# DocumentChangedEventArgs Properties

---
The DocumentChangedEventArgs type exposes the following members.
| Name| Description
---|---|---
| Cancellable|  Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs)
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs)
| Operation|  The operation associated with this event
Top
#### Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace